astb_relise/src/Catalogs/ТочкиХранения/ТочкиХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиХранения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКНаименованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТочкиХранения</name>
    <type>
      <types>CatalogRef.ВидыТочекХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

astb_relise/src/Catalogs/ТочкиХранения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если СокрЛП(Код) = "" Тогда
		УстановитьНовыйКод();
	КонецЕсли;
	
	НовыйПолныйАдрес = ПроцедурыРаботыСНормамиСервер.СлитьАдреса(ПроцедурыРаботыСНормамиСервер.ПолучитьПолныйАдресТочкиХранения(Родитель), Код);
	
	Если ПолныйАдрес <> НовыйПолныйАдрес Тогда
		ПолныйАдрес = НовыйПолныйАдрес;
		//Если ЭтоГруппа Тогда
		//	НеобходимоПерезаписатьПодчиненных = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	// Наименование элемента справочника состоит из наименования вида, полного наименование и полного
	// кода справочника
	НовоеНаименование = СокрЛП(ВидТочкиХранения.Наименование) + " " + ПолныйАдрес;
	
	Если ДополнениеКНаименованию <> "" Тогда
		// Добавим к наименованию полное наименование в скобках
		НовоеНаименование = НовоеНаименование + " (" + СокрЛП(ДополнениеКНаименованию) + ")";
	КонецЕсли;
	
	Если Наименование <> НовоеНаименование Тогда
		Наименование = НовоеНаименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
